# Step 1.11

In [1]:
import pandas as pd

## Example I have chosen

In my case, as an example, I have created a CSV file called data_analytics_marks.csv to store the marks in Data Analytics of 5 students as follows

 * Peter,Rees,Male,80
 * Bhusan,Chettri,Male,70
 * Stacy,Barker,Female,87
 * Hilary,Rai,Female,78
 * Thomas,Hain,Male,80 
 

### How did I create this?
- Open any text editor tool (for example notepad)
- enter those details manually separated by a comma
- as per step 1.11 you are free to create any example as you like (manually) and then read that csv file in Jupyter notebook and check its contents!



Please note that I have placed the file 'data_analytics_marks.csv' in the same working directory where my Jupyter notebook is running from. In my case this Jupyter notebook file name is week1.ipynb

In [2]:
# by default pandas assumes the first row as header information. 
# If we do not provide the header=None parameter, then the first row is taken as header.

mydataset = pd.read_csv('data_analytics_marks.csv')

In [3]:
# Lets check the contents. Just type the name of the dataFrame 

mydataset

    Peter     Rees    Male  80
0  Bhusan  Chettri    Male  70
1   Stacy   Barker  Female  87
2  Hilary      Rai  Female  78
3  Thomas     Hain    Male  80

In [4]:
# lets check the basic statistics of the dataframe
mydataset.describe()

              80
count   4.000000
mean   78.750000
std     6.994045
min    70.000000
25%    76.000000
50%    79.000000
75%    81.750000
max    87.000000

In [5]:
# Example2: lets force pandas not to use the first column of our csv file for header information
# for that we can supply a parameter: header=None as shown below

mydataset = pd.read_csv('data_analytics_marks.csv',header=None)

In [6]:
mydataset

        0        1       2   3
0   Peter     Rees    Male  80
1  Bhusan  Chettri    Male  70
2   Stacy   Barker  Female  87
3  Hilary      Rai  Female  78
4  Thomas     Hain    Male  80

### Why do I see  a column of integers (0-4) and a row (0-3) in my dataframe?

 * this is the default behaviour (which we can change - we will see more later in week2). By default pandas assigns a column of integers ranging from 0 to N-1 (where N = total rows or records).
 * same is the case with header information. The first row is taken as header by default.

In [7]:
# lets check the basic statistics of the dataframe
mydataset.describe()

               3
count   5.000000
mean   79.000000
std     6.082763
min    70.000000
25%    78.000000
50%    80.000000
75%    80.000000
max    87.000000

# step 1.16

### I have created a csv file called 'dataset_1.16.csv' and have provided following information (from step 1.16) manually
 
* Customer,Age,Gender,City,Marital status
* Linda,39,Female,London,Single
* John,32,Male,Birmingham,Married 

NOTE: The csv file 'dataset_1.16.csv' is stored in the same directory/folder where this Jupyter notebook is running from.

In [8]:
# lets read the dataset using pandas

mydataset=pd.read_csv('dataset_1.16.csv')

In [9]:
# lets see its contents

mydataset

  Customer  Age  Gender        City Marital status
0    Linda   39  Female      London         Single
1     John   32    Male  Birmingham        Married

In [10]:
# example of slicing
# Give me the first record

firstRecord = mydataset.iloc[0]

In [11]:
firstRecord

Customer           Linda
Age                   39
Gender            Female
City              London
Marital status    Single
Name: 0, dtype: object

In [12]:
secondRecord = mydataset.iloc[1]

In [13]:
secondRecord

Customer                John
Age                       32
Gender                  Male
City              Birmingham
Marital status       Married
Name: 1, dtype: object

In [14]:
# example of slicing. Another approach
# Give me the all the rows but only the first column

firstCol = mydataset.iloc[:, 0]

In [15]:
firstCol

0    Linda
1     John
Name: Customer, dtype: object

In [16]:
firstCol_example2 = mydataset.loc[:, 'Customer']

# Give me the all the rows but only the first column - another approach

In [17]:
firstCol_example2

0    Linda
1     John
Name: Customer, dtype: object

In [18]:
# Test conditions on the dataframe

filtered_data_1 = mydataset[mydataset['Age']>32] #give me only those records for which Age is greater than 32

In [19]:
filtered_data_1

  Customer  Age  Gender    City Marital status
0    Linda   39  Female  London         Single

In [20]:
# Test conditions on the dataframe
# showing steps

data_indexes = mydataset['Age']>32

filtered_data_1 = mydataset[data_indexes] 
      #give me only those records for which data_indexes is True

In [21]:
data_indexes   #this will hold boolean values

0     True
1    False
Name: Age, dtype: bool

In [22]:
filtered_data_1

  Customer  Age  Gender    City Marital status
0    Linda   39  Female  London         Single

In [23]:
# Renaming the column names
# Lets rename the column 'Gender' to 'Sex' in our dataframe


mydataset.rename(columns={'Gender': 'Sex', 'City': 'Address'}, inplace=True)

# if you do not use the parameter inplace=True, then you will have to store the result of executing rename
# on dataframe as shown below

# mydataset_2 = mydataset.rename(columns={'Gender': 'Sex', 'City': 'Address'})

In [24]:
mydataset

  Customer  Age     Sex     Address Marital status
0    Linda   39  Female      London         Single
1     John   32    Male  Birmingham        Married